greeting = '''Добро пожаловать!
Здесь должно быть описание кнопок.'''

about = '''Здесь должна быть информация о боте.'''
check_list = '''Пункт 1: подписаться на телеграм канал Investory.'''

how_to_make_portfolio = '''Шаг 1:
Зарегистрируйтесь в Тинкькофф Инвестиции.

Шаг 2:
Закупить теслу на всю котлету.

Шаг 3:
Фиксируем прибыль!!!'''

trade_rules = '''Вы в торговом режиме.
Чтобы узнать правила, попросите создателей их создать.'''

useful_info = '''Ссылка на канал: https://t.me/investory_startup.
Это вся полезная информация, которую я пока что знаю.'''

trade_start = '''Выберите категорию'''

balance = '''Ваш баланс: {} ₽.'''

my_portfolio = '''Ваш портфель:\n\n'''
portfolio_share = '''{}: {} шт.\n'''
portfolio_empty = '''Пусто'''

shares_list = '''Выберите акцию, введя ее тикер:\n\n'''

shares_info = '''Информация об акции:
Название: {} 
Цена: {} ₽'''
shares_quantity = '''Напишите целое число — объем акций (лот)'''
shares_success = '''Успешно!
Список акций в портфеле:\n\n'''


shares_confirmation = '''Подтверждение:
{} акции {} - {} ед.'''

shares_not_enough = '''Недостаточно акций в портфеле.
Требуется: {} ед., имеется: {} ед.'''

not_implemented = '''Сорян, это еще не доделали.'''
wrong_command = '''Аккуратнее с языком, молодой человек'''
